<template>
      <div class="page">
           <Header title="用户托管协议" @handleLeft="handleLeft()"></Header>
           <div class="wrap">
                <div class="txt">用户托管协议</div>
                <div class="text2">矿机租赁、委托管理服务协议（电子签约版）</div>
                <div class="dex">
                     
                                尊敬的用户朋友：<br>
合盈云算（以下简称我们）致力于提供filecoin挖矿即服务的信条， 使用最新技术提供多算法、filecoin币种的云挖矿服务。 通过将我们自有矿机租赁给用户（以下简称“您”），并同步提供矿机委托管理和挖矿日常维护业务，为用户提供不同规模的加密数字货币挖矿能力的一站式解决方案。<br>
以下条款为我们的服务条款，通过您在我们网站平台的操作，双方将共同受到服务条款的约束，通过服务条款建立法律上的权利义务关系。请您先仔细阅读本服务条款内容，充分理解本协议及各条款，尤其是字体加粗部分。如果您对本合约内容有任何疑问，请勿进行下一步操作。<br>
您使用平台服务、通过网络页面确认或以其他方式接受本协议，即视为您已充分理解本协议所有条款，并同意与我们订立本协议。<br>
如您在同意订立本协议之前，对本协议内容存在疑虑或异议，请您联系我们，以便我们为您进行解释和说明，使您能够充分理解，从而帮助您自主决定是否接受本协议及是否使用我们的服务。<br>


根据《中华人民共和国合同法》等有关法律、法规的规定，经双方平等、自愿协商，特就 用户向我们租赁矿机并委托我们提供托管服务 事宜，达成以下一致条款，以供双方共同遵照执行：<br>



一、矿机的租赁<br>

1.1 我们向用户提供租赁委托管理服务的矿机信息入下：<br>

1.2 租赁矿机：我们向用户提供本协议所附带订单内指定型号和数量的矿机，用户可以选择租赁的方式来取得矿机在本协议规定期限内的使用权；用户委托我们对矿机进行管理，以便于实现用户算力的最大化，最大限度保障用户的权益。<br>
二、矿机的委托管理服务内容<br>
2.1  场地配套服务：我们为租赁矿机的用户提供主机场地、电力配套、宽带网络配套、安全监控及主机管理和故障的排查并协助矿机生产厂家进行维修等托管服务。<br>
2.2  日常管理服务：我们进行日常管理，以保证用户租赁委托管理的矿机平稳运行。<br>
2.3  网络与信息安全保障：我们有按要求配合国家有关部门处理互联网络与信息安全工作的义务。<br>
2.4  矿机的安全和赔偿：我们应保证用户委托管理的矿机的安全，尽力保证不丢失、不被破坏。如果因我们自身管理问题产生丢失、破坏的情况，我们应赔偿用户矿机，赔偿方式为同等数量同等规格的机器或等值现金。非因如果因我们自身管理问题产生丢失、破坏的情况，我们就从第三人追偿的金额为限赔偿用户矿机。<br>
2.5  最大算力保障：我们尽可能保证租赁的矿机每月的停电时间不超过 18 个小时， 以保障用户在租赁期限内最大限度实现算力收益；另外我们保证对用户按照一比一的方式，弥补停电造成的矿机停运对时长损失，即每停电一个小时，我们多补偿用户一个小时的矿机租赁时间。停电时间按照电力部门公告的停电时间为准。<br>

三、租赁和委托管理的期限<br>

3.1  租赁的方式，用户委托管理的矿机，其运行期限为:12个月。矿机运行和维修费用由我们专门团队负责，用户不承担运维费用。期满后续签合同。
3.2  托管期间内，用户保证机器由我们继续委托管理运行的前提下，将机器转让给第三方时， 用户、受让方需与我们办理机器转让变更手续。

四、费用负担<br>

用户需要向我们支付的费用有年度矿机租赁费；我们会及时向用户提出费用负担的书面通知页面及付费链接；在费用未得到用户的充分知晓和认可的情况下，我们不会采取任何扣费的操作方式或任何类似扣费的操作。在委托管理期限届满后，用户未及时支付相关费用的，我们将暂停向用户提供管理服务。


五、用户和我们的权利义务关系<br>

5.1  用户和我们均应严格履行本协议的各项约定，任何一方违约的，则守约方有权向违约方发送书面通知，违约方应自收到书面通知后 7 个工作日内向守约方书面说明理由， 若未在约定期限说明理由，又未予以更正的，则作为用户的守约方有权采取举报、诉讼或仲裁等救济措施，我们则有权采取其他合法技术措施以实现自力救济，但保留通过诉讼、仲裁方式维护自身权益的权利。<br>


六、关于用户算力最大化的法律声明<br>

我们致力于为用户提供一站式数字货币算力解决方案，但数字货币算力带来的收益，受到对应数字货币市场总算力状况，某一时段的数字货币挖矿分配方案、对应币值波<br>
动等多个方面的影响，而这些都是不可预测的。 每个客户都必须就租赁矿机带来的收益作出独立判断，并应在选择是否租赁矿机时考虑风险和自身情况。我们并不对客户挖矿收益承担责任。<br>


七、协议变更、解除、终止和权利义务的转让<br>
7.1  协议变更<br>
我们保留根据市场的需要，不定期修改交易方式、托管时长等协议内容的权利， 如果根据诚实信用原则是被认为合理的或必要的。<br>
7.2  协议解除与终止<br>
7.2.1  您在使用平台服务的过程中，如果有下列情形发生，我们可以单方面解除本协议：<br>
7.2.2  您的账户因任何原因注销的；<br>
7.2.3  冒用他人名义、盗用他人账户使用平台服务的；<br>
7.2.4  为非法目的使用平台服务的；<br>
7.2.5  从事任何可能侵害平台系统、资料之行为；<br>
7.2.6  违反任何法律法规、本协议约定的；<br>
7.2.7  监管机构认为平台提供的服务不再符合相关监管规定的；<br>
7.2.8  除上述原因外，我们可以根据风险及自身业务运营情况需要终止向您提供某些服务，届时公司将会视情况公告或告知。鉴于这属于正常商业决策行为，如因此导致您无法使用平台服务或服务受到限制的，您理解我们无须对此承担责任。<br>
7.3  权利义务的转让<br>
我们可以基于平台服务的需要，变更或增加履约主体，如您继续使用平台服务的，视为同意变更后的主体或新增的主体作为与您履约的相对方。<br>


八、争议的解决<br>
本协议的订立、效力、解释、履行及争议的解决均适用中华人民共和国法律。在协议履行期间，凡由本协议引起的或与本协议有关的一切争议、纠纷，当事人应首先协商解决。协商不成，各方一致同意提交被告方所在地人民法院通过诉讼方式解决。<br>


九、通知<br>
本协议履行过程中，我们向您发出的书面通知方式包括邮寄纸质通知、我们网站公告、电子邮件、机短信和传真等方式。<br>

十、其他<br>
10.1  本协议的附件及各项补充、修订或变更，为本协议不可分割的组成部分，与本协议正文具有同等法律效力。<br>
10.2  本协议各方应按法律法规及相关规定各自承担与本协议相关的税费。<br>
10.3 本协议未尽事宜，由双方协商处理，或者按国家有关法律、法规的规定执行。<br>
                            
                </div>
           </div>     
      </div>

      
</template>


<script>
import Header from './common/NavView';
export default {
    name: "home",
    components: {
        Header
    },
    data(){
        return{
            index:0,
        }
    },
   
    methods:{
         handleLeft(){
             this.$router.go(-1);
         }
    }
}
</script>

<style lang="less" scoped>
.page{
   background: rgba(239, 240, 249, 1);
   background: #fff;
}
.wrap{
     position: absolute;
     left: 0;
     top: 1.04rem;
     bottom: 0;
     width: 100%;
    //  border: 1px solid #000;
     text-align: left;
     .txt{
        margin-left: 0.2rem;
        margin-right: 0.2rem;
        margin-top: 0.43rem;
        font-size: 0.36rem;
        line-height: 0.4rem;
        font-family: Source Han Sans CN;
        font-weight: bold;
        color: #2C3A5C;

     }
     .text2{
          margin-left: 0.2rem;
        margin-right: 0.2rem;
        margin-top: 0.26rem;
        font-size: 0.3rem;
        line-height: 0.4rem;
        font-family: Source Han Sans CN;
        font-weight: bold;
        color: #2C3A5C;
     }
     .dex{
           margin-left: 0.2rem;
        margin-right: 0.2rem;
        margin-top: 0.26rem;
        font-size: 0.3rem;
        line-height: 0.48rem;
        font-family: Source Han Sans CN;
        
        color: #2C3A5C;
     }
}
</style>